Tekla Open API Reference for Tekla Structures 2025
DistanceConverter Class
 The DistanceConverter class converts types to and from the distance type.
Inheritance Hierarchy
System.Object
 System.ComponentModel.TypeConverter
 Tekla.Structures.Datatype.DistanceConverter
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class DistanceConverter : TypeConverter
Public NotInheritable Class DistanceConverter
	Inherits TypeConverter
The DistanceConverter type exposes the following members.
Constructors
Name | Description
DistanceConverter
Initializes a new instance of the DistanceConverter class
Top
Methods
Name | Description
CanConvertFrom
 Checks whether the conversion can be made from the source type to the distance type.
 (Overrides TypeConverter.CanConvertFrom(ITypeDescriptorContext, Type).)
CanConvertTo
 Checks whether the conversion can be made from the distance type to the destination type.
 (Overrides TypeConverter.CanConvertTo(ITypeDescriptorContext, Type).)
ConvertFrom
 Converts an object from the given culture to the distance type.
 (Overrides TypeConverter.ConvertFrom(ITypeDescriptorContext, CultureInfo, Object).)
ConvertTo
 Converts an object from the distance type to the given destination type.
 (Overrides TypeConverter.ConvertTo(ITypeDescriptorContext, CultureInfo, Object, Type).)
Top
See Also
Reference
Tekla.Structures.Datatype Namespace